Revit 2027 API
ExternalDataManagerTool(ExternalDataManagerTool) Constructor
 Create a copy of the object.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerTool(
	ExternalDataManagerTool other
)
Public Sub New (
	other As ExternalDataManagerTool
)
public:
ExternalDataManagerTool(
	ExternalDataManagerTool^ other
)
new :
        other : ExternalDataManagerTool -> ExternalDataManagerTool
Parameters
other ExternalDataManagerTool
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalDataManagerTool Class
ExternalDataManagerTool Overload
Autodesk.Revit.UI Namespace